[{"postTitle":"Root Down","postDisplayDate":"Feb. 19, 2016","postSubTitle":"Trendy Neighborhood Spot that Suffers from the Hype","paragraphSingleArea":"<p>Root Down is a thing in Denver.  After five years of thinking about it, then dismissing it for either a more Capitol Hill accessible or budget friendly date night option, the husband and I finally found ourselves braving the LoHi hordes to see what the deal was with Root Down.<\/p><p>The crowd at Root Down is eclectic in the way that crowds at places like Root Down are eclectic: it boasted a wide array of different kinds of slightly hip (but not too hip) financially stable looking white people.  The vibe is comfortably trendy, with some of the industrial chic touches one sees everywhere, paired with some nods to old Hollywood (photos and TCM projected on a wall) that add a bit of a different twist.  To the credit of the host staff, we were promptly greeted and sorted out from a separate, very large group that entered with us, and we were happily directed to the bar area.  (I will note that I appreciate a staff that happily point people towards the bar if they don’t have a reservation rather than the “better luck next time” thousand yard stare I’ve gotten at other places.)<\/p><p>So, lady, how was the damn food already?  Husband and I elected to share two of the share (duh) plates, as well as a dessert.  We ordered horseradish gnocchi, diver sea scallops and the honeycomb and cheese dessert.  The gnocchi had a beautiful texture, hearty and satisfying without being heavy or gummy at all, and I appreciated the amount of sear of them to give them just the right amount of snap on the outside when I bit in.  Husband and I cleaned our plate, but we did note that some of the (many) components did not add a lot to the dish as a whole.  This issue would reoccur, to a much greater extent, when we moved on to the scallops.  Seared scallops are a good thing.  Seared scallops are also a kind of quintessential restaurant dish in that they are something that really can’t be made at home.  I have no complaints with how Root Down sears its scallops, they had lovely caramelization on the outside, while retaining a delightful creaminess within.  The rest of dish, however, seemed a bit jumbled.  To quote the Root Down menu, the Diver Scallops are served with Plantain Hash, Brussel Sprouts, Butternut Squash, Edamame, Fried Capers, Pickled Red Onions and Lemon Habanero Tartar Sauce.  That’s a lot of stuff.  I will say that the scallops, tartar sauce, and fried capers together constituted a lovely bite.  I will also say that the pickled red onions, which were placed on a bed of micro greens, made for a refreshing salad.  I do not think that my lovely scallop bite and the refreshing salad had much to do with each other.  The remainder of the ingredients were, I’m assuming, to be found in the very sweet sticky mound of stuff also on the plate, which Husband and I neither enjoyed with the scallops or on its own.  The plate, in short, seriously lacked harmony.   Finally, the honeycomb and cheese dessert, was, you know, a cheese course, and a fairly harmonious, if not particularly inspired one.  The honeycomb was, it should be noted, phenomenal, and I wanted more than the small portion that I received, and it played very well with the mild blue cheese and apples it was paired with. <\/p><p>Long story short, would we go back? Shrug.  The food was pretty good, the atmosphere was fun.  I would be interested in investigating their brunch, and can see myself checking out what the dining room experience would be like, but, as a whole, there are lots of places closer to home that I’ve had better food at the same, if not slightly less, price.  For my part, I’m glad I finally checked out the Root Down phenomenon, but I won’t be rushing back.<\/p>","heartsSelected":"<i class=\"fa fa-heart\"><\/i><i class=\"fa fa-heart\"><\/i><i class=\"fa fa-heart\"><\/i><i class=\"fa fa-heart\"><\/i><i class=\"fa fa-heart-o\"><\/i><i class=\"fa fa-heart-o\"><\/i>","emojiMouthfulBlurgs":"<p class=\"bottomMouthfulIcons\"><i class=\"fa fa-dollar\"><\/i> A little pricier than comparable restaurants<\/p>","resturantWebsite":"http:\/www.rootdowndenver.com\/","resturantNeighborHood":"LoHi","docURLs":["data\/images\/rootdown.jpg","data\/images\/rootdown2.jpg","data\/images\/rootdown3.jpg"]}

,{"postTitle":"North","postDisplayDate":"Feb. 20, 2016","postSubTitle":"Great place for lunch in Cherry Creek","paragraphSingleArea":"<p>Always end up stopping here after shopping.  Good place to get a late lunch and a drink later in the day because it's West facing patio makes it a comfortable spot for afternoon sunshine. And you need a pick me up after shopping.  Never had dinner here, just a favorite late afternoon hangout.<\/p>","heartsSelected":"<i class=\"fa fa-heart\"><\/i><i class=\"fa fa-heart\"><\/i><i class=\"fa fa-heart\"><\/i>","emojiMouthfulBlurgs":"\n\n\n","resturantWebsite":"http:\/\/www.northitaliarestaurant.com\/","resturantNeighborHood":"Cherry Creek","docURLs":["data\/images\/north1.jpg","data\/images\/north2.jpg","data\/images\/north3.jpg"]}
]
